---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailingSlopeOption.ByHost
enum: Autodesk.Revit.DB.Architecture.RailingSlopeOption
source: html/5399a679-85e7-9d6d-2ed3-f82f5bfe2785.htm
---
# Autodesk.Revit.DB.Architecture.RailingSlopeOption.ByHost

The slope of the railing is determined by its host.